package OJ_07;

public class OJ_07_01 {
    public static void main(String[] args) {
        System.out.println("朋友们好啊我是浑元形意太极门掌门人马保国。刚才有个朋友问我马老师发生甚么事了，我说怎么回事，给我发了一几张截图，我一看！嗷！原来是佐天，有两个年轻人，三十多岁，一个体重，九十多公斤，一个体重八十多公斤，他们说，唉…有一个说是我在OJ上写代码，颈椎写坏了，马老师你能不能教教我浑元功法，哎…帮助治疗一下，我的颈椎病。我说可以。我说你在PTA练死劲儿，不好用，他不服气。我说小朋友：你两个手来比我一个手指头写的速度，他比不过。他说你这也没用。我说我这个有用，这是化劲儿，传统功夫是讲化劲儿的四两拨千金。二百多斤的英国工程师，都比我不动我这一个手指头。啊…哈！他非和我试试，我说可以。诶…我一说的他啪就站起来了，很快嗷！然后显示一个for循环，然后里面再套一个for循环，我全部防出去了啊，防出去以后自然是传统编码以点到为止，右拳放到回车键上没提交，我笑一下准备收收，由这时间，按传统testcase的点到为止我已经AC了，如果这一拳发力，一拳就把这道题A透了啊，放在键盘上没有按下去，他也承认，我先写完的return 0。他不知道我手放在提交上，他承认我先打return 0，啊，我收手的时间不打了，他突然袭击Time Limit Exceeded 来打我脸，啊，我大意了啊，没有闪，矮…他的运行超时给我收，啊，右手，蹭了一下，但没关系啊！他也说，啊他截图也说了，两分多钟以后，当时流眼泪了，捂着眼，我说停停。然后两分钟钟以后，两分多钟以后诶就好了，我说小伙子你不讲武德你不懂，他说马老师对不对不起，我不懂规矩。啊，我是…他说他是乱打的，他可不是乱打的啊，哈希链表贪心，训练有素，后来他说他打过三四年CF，啊，看来是有备而来！这两个年轻人不讲武德，来骗，来偷袭，我二十多岁的小同志，这好吗？这不好，我劝这位年轻人耗子尾汁，好好反思，以后不要再犯这样的聪明，小聪明，啊，呃…武林要以和为贵，要讲武德，不要搞窝里斗，谢谢朋友们！\n");
    }
}
